In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [9]:
df1 = DataFrame({"key":["x","y","z","x"],"data_set_1":[1,2,3,4]})  # dict 创建dataframe
df1

  key  data_set_1
0   x           1
1   y           2
2   z           3
3   x           4

In [3]:
df2 = DataFrame({"key":["A","B","C"],"data_set_2":[4,5,6]})
df2

  key  data_set_2
0   A           4
1   B           5
2   C           6

In [11]:
pd.merge(df1,df2,on = None) # on 默认是None，

Empty DataFrame
Columns: [key, data_set_1, data_set_2]
Index: []

In [5]:
df3 = DataFrame({"key":["x","B","C"],"data_set_2":[4,5,6]})
df3

  key  data_set_2
0   x           4
1   B           5
2   C           6

In [14]:
pd.merge(df1,df3,how = "inner") # merge()根据相同的cloumns名字对应的内容合并

  key  data_set_1  data_set_2
0   x           1           4
1   x           4           4

In [13]:
pd.merge(df1,df3,on = "data_set_1"how = "inner") # on 要取相同的columns名字

SyntaxError: invalid syntax (<ipython-input-13-5476a87c2969>, line 1)

In [16]:
pd.merge(df1,df3,on = "key",how = "left")  # 根据参数中df1,df3 ,left 是df1 就以df1为基准，没有的补充NaN

  key  data_set_1  data_set_2
0   x           1         4.0
1   y           2         NaN
2   z           3         NaN
3   x           4         4.0

In [17]:
pd.merge(df1,df3,on = "key",how = "right")  # 根据参数中df1,df3 ,right是df3就以df3为基准，没有的补充NaN

  key  data_set_1  data_set_2
0   x         1.0           4
1   x         4.0           4
2   B         NaN           5
3   C         NaN           6

In [19]:
pd.merge(df1,df3,on = "key",how = "outer")  # outer是left和right的结合

  key  data_set_1  data_set_2
0   x         1.0         4.0
1   x         4.0         4.0
2   y         2.0         NaN
3   z         3.0         NaN
4   B         NaN         5.0
5   C         NaN         6.0